In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
titanic = sns.load_dataset('titanic')
print(titanic.head())
print(titanic.shape)

   survived  pclass     sex   age  sibsp  parch     fare embarked  class
0         0       3    male  22.0      1      0   7.2500        S  Third  \
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True
(891, 15)

In [5]:
df = titanic.loc[:, ['age', 'fare']]
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [14]:
df.apply(len)

def missing_value(series):
    y = series.isnull()
    return y
    
print(df.apply(missing_value))
print(df.apply(lambda x: x.isnull()))

df.apply(lambda x: x['age'] + x['fare'], axis = 1) # default = 0

       age   fare
0    False  False
1    False  False
2    False  False
3    False  False
4    False  False
..     ...    ...
886  False  False
887  False  False
888   True  False
889  False  False
890  False  False

[891 rows x 2 columns]
       age   fare
0    False  False
1    False  False
2    False  False
3    False  False
4    False  False
..     ...    ...
886  False  False
887  False  False
888   True  False
889  False  False
890  False  False

[891 rows x 2 columns]

0       29.2500
1      109.2833
2       33.9250
3       88.1000
4       43.0500
         ...
886     40.0000
887     49.0000
888         NaN
889     56.0000
890     39.7500
Length: 891, dtype: float64

In [18]:
## 
df.head()

df.sort_values(by = 'fare', ascending=True)

      age      fare
271  25.0    0.0000
597  49.0    0.0000
302  19.0    0.0000
633   NaN    0.0000
277   NaN    0.0000
..    ...       ...
438  64.0  263.0000
341  24.0  263.0000
737  35.0  512.3292
258  35.0  512.3292
679  36.0  512.3292

[891 rows x 2 columns]

In [23]:
## 
print(titanic.columns)
rev_columns = list(reversed(titanic.columns))
# print(list(rev_columns))
rev_titanic = titanic[rev_columns]
print(rev_titanic.head())

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')
   alone alive  embark_town deck  adult_male    who  class embarked     fare
0  False    no  Southampton  NaN        True    man  Third        S   7.2500  \
1  False   yes    Cherbourg    C       False  woman  First        C  71.2833
2   True   yes  Southampton  NaN       False  woman  Third        S   7.9250
3  False   yes  Southampton    C       False  woman  First        S  53.1000
4   True    no  Southampton  NaN        True    man  Third        S   8.0500

   parch  sibsp   age     sex  pclass  survived
0      0      1  22.0    male       3         0
1      0      1  38.0  female       1         1
2      0      0  26.0  female       3         1
3      0      1  35.0  female       1         1
4      0      0  35.0    male       3         0

In [34]:
df = pd.read_excel('./주가데이터.xlsx', header = 0,
                   index_col= None)

# print(df.head())

dates = df['연월일'].astype('str')
dates = dates.str.split("-")

df['년'] = dates.str.get(0)
df['월'] = dates.str.get(1)
df['일'] = dates.str.get(2)

print(df['월'])
# print(dates)

0     07
1     06
2     06
3     06
4     06
5     06
6     06
7     06
8     06
9     06
10    06
11    06
12    06
13    06
14    06
15    06
16    06
17    06
18    06
19    06
Name: 월, dtype: object

In [38]:
## Filter
a_event = np.array([True, True, False])
b_event = np.array([True, False, False])

and_result = a_event & b_event
print(and_result)

or_result = a_event | b_event
print('or = \n', or_result)

my_data = np.array(['rose', 'lily', 'golden bell'])

print(my_data[and_result])
print(my_data[or_result])

[ True False False]
or =
 [ True  True False]
['rose']
['rose' 'lily']

In [51]:
# titanic.head()
# age_lt_10 = titanic.age >= 10
# print(age_lt_10)

# print(titanic[age_lt_10])

mask1 = (titanic.age >= 10) & (titanic.age < 20)
print(mask1.value_counts())

# df_teenager = titanic[mask1]
df_teenager = titanic.loc[mask1, :]

df_teenager.head()

titanic.sex == 'female'

mask2 = (titanic.age <= 10) & (titanic.sex == 'female')
df_under10_female =  titanic[mask2]

df_under10_female.shape

mask3 = (titanic.age < 10) | (titanic.age > 60)
titanic[mask3].shape

titanic.loc[mask3, ['age', 'sex', 'alone']]

age
False    789
True     102
Name: count, dtype: int64

(84, 15)

In [57]:
## isin()

# titanic['sibsp'].value_counts()
titanic.sibsp.value_counts()
titanic.dtypes

mask_126 = (titanic.sibsp == 1) |(titanic.sibsp == 2)|(titanic.sibsp == 6)
titanic[mask_126].head(20)

mask_126_isin = titanic.sibsp.isin([1, 2, 6])
print(mask_126_isin)

0       True
1       True
2      False
3       True
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: sibsp, Length: 891, dtype: bool

In [59]:
## pd.concat
df1 = pd.DataFrame({'a': ['a0', 'a1', 'a2', 'a3'],
                    'b': ['b0', 'b1', 'b2', 'b3'],
                    'c': ['c0', 'c1', 'c2', 'c3']},
                    index=[0, 1, 2, 3])
df2 = pd.DataFrame({'a': ['a2', 'a3', 'a4', 'a5'],
                    'b': ['b2', 'b3', 'b4', 'b5'],
                    'c': ['c2', 'c3', 'c4', 'c5'],
                    'd': ['d2', 'd3', 'd4', 'd5']},
                    index=[2, 3, 4, 5])
print(df1)
print(df2)

    a   b   c
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3
    a   b   c   d
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  a4  b4  c4  d4
5  a5  b5  c5  d5

In [69]:
pd.concat([df1, df2], axis = 0, ignore_index= True)
print(pd.concat([df1, df2], axis = 1, join = 'outer'))
print('\n\n')
print(pd.concat([df1, df2], axis = 1, join = 'inner',
                ignore_index=True))

     a    b    c    a    b    c    d
0   a0   b0   c0  NaN  NaN  NaN  NaN
1   a1   b1   c1  NaN  NaN  NaN  NaN
2   a2   b2   c2   a2   b2   c2   d2
3   a3   b3   c3   a3   b3   c3   d3
4  NaN  NaN  NaN   a4   b4   c4   d4
5  NaN  NaN  NaN   a5   b5   c5   d5



    0   1   2   3   4   5   6
2  a2  b2  c2  a2  b2  c2  d2
3  a3  b3  c3  a3  b3  c3  d3

In [75]:
sr1 = pd.Series(['e0', 'e1', 'e2', 'e3'], name = 'e')
sr2 = pd.Series(['f0', 'f1', 'f2'], name='f', index=[3, 4, 5])
sr3 = pd.Series(['g0', 'g1', 'g2', 'g3'], name='g')

print(sr1)
print(sr2)
print(sr3)

result = pd.concat([sr1, sr2], axis = 1)
result2 = pd.concat([df2, sr2], axis = 1)

print(result2)

0    e0
1    e1
2    e2
3    e3
Name: e, dtype: object
3    f0
4    f1
5    f2
Name: f, dtype: object
0    g0
1    g1
2    g2
3    g3
Name: g, dtype: object
    a   b   c   d    f
2  a2  b2  c2  d2  NaN
3  a3  b3  c3  d3   f0
4  a4  b4  c4  d4   f1
5  a5  b5  c5  d5   f2

In [76]:
df1 = pd.read_excel('./stock price.xlsx', header=0)
df2 = pd.read_excel('./stock valuation.xlsx', header=0)

print(df1.head())
print(df2.head())

       id stock_name          value   price
0  128940       한미약품   59385.666667  421000
1  130960     CJ E&M   58540.666667   98900
2  138250      엔에스쇼핑   14558.666667   13200
3  139480        이마트  239230.833333  254500
4  142280     녹십자엠에스     468.833333   10200
       id     name           eps     bps        per       pbr
0  130960   CJ E&M   6301.333333   54068  15.695091  1.829178
1  136480       하림    274.166667    3551  11.489362  0.887074
2  138040  메리츠금융지주   2122.333333   14894   6.313806  0.899691
3  139480      이마트  18268.166667  295780  13.931338  0.860437
4  145990      삼양사   5741.000000  108090  14.283226  0.758627

In [82]:
merge_inner = pd.merge(df1, df2, on = 'id', how = 'inner')

print('merge_inner = \n\n', merge_inner)

merge_outer = pd.merge(df1, df2, on = 'id', how = 'outer')
print('merge_outer = \n\n', merge_outer)

merge_inner =

        id stock_name          value   price    name           eps     bps
0  130960     CJ E&M   58540.666667   98900  CJ E&M   6301.333333   54068  \
1  139480        이마트  239230.833333  254500     이마트  18268.166667  295780
2  145990        삼양사   82750.000000   82000     삼양사   5741.000000  108090
3  185750        종근당   40293.666667  100500     종근당   3990.333333   40684
4  204210     모두투어리츠    3093.333333    3475  모두투어리츠     85.166667    5335

         per       pbr
0  15.695091  1.829178
1  13.931338  0.860437
2  14.283226  0.758627
3  25.185866  2.470259
4  40.802348  0.651359
merge_outer =

         id stock_name          value     price       name           eps
0   128940       한미약품   59385.666667  421000.0        NaN           NaN  \
1   130960     CJ E&M   58540.666667   98900.0     CJ E&M   6301.333333
2   138250      엔에스쇼핑   14558.666667   13200.0        NaN           NaN
3   139480        이마트  239230.833333  254500.0        이마트  18268.166667
4   142280     녹십자엠에스     468.833333   10200.0        NaN           NaN
5   145990        삼양사   82750.000000   82000.0        삼양사   5741.000000
6   185750        종근당   40293.666667  100500.0        종근당   3990.333333
7   192400      쿠쿠홀딩스  179204.666667  177500.0        NaN           NaN
8   199800         툴젠   -2514.333333  115400.0        NaN           NaN
9   204210     모두투어리츠    3093.333333    3475.0     모두투어리츠     85.166667
10  136480        NaN            NaN       NaN         하림    274.166667
11  138040        NaN            NaN       NaN    메리츠금융지주   2122.333333
12  161390        NaN            NaN       NaN      한국타이어   5648.500000
13  181710        NaN            NaN       NaN  NHN엔터테인먼트   2110.166667
14  207940        NaN            NaN       NaN   삼성바이오로직스   4644.166667

         bps        per       pbr
0        NaN        NaN       NaN
1    54068.0  15.695091  1.829178
2        NaN        NaN       NaN
3   295780.0  13.931338  0.860437
4        NaN        NaN       NaN
5   108090.0  14.283226  0.758627
6    40684.0  25.185866  2.470259
7        NaN        NaN       NaN
8        NaN        NaN       NaN
9     5335.0  40.802348  0.651359
10    3551.0  11.489362  0.887074
11   14894.0   6.313806  0.899691
12   51341.0   7.453306  0.820007
13   78434.0  30.755864  0.827447
14   60099.0  89.790059  6.938551

In [83]:
merge_left = pd.merge(df1, df2, how = 'right',
                      left_on= 'stock_name', right_on = 'name')

print('merge_outer = \n\n', merge_left)

merge_outer =

      id_x stock_name          value   price      id_y    name           eps
0  128940       한미약품   59385.666667  421000       NaN     NaN           NaN  \
1  130960     CJ E&M   58540.666667   98900  130960.0  CJ E&M   6301.333333
2  138250      엔에스쇼핑   14558.666667   13200       NaN     NaN           NaN
3  139480        이마트  239230.833333  254500  139480.0     이마트  18268.166667
4  142280     녹십자엠에스     468.833333   10200       NaN     NaN           NaN
5  145990        삼양사   82750.000000   82000  145990.0     삼양사   5741.000000
6  185750        종근당   40293.666667  100500  185750.0     종근당   3990.333333
7  192400      쿠쿠홀딩스  179204.666667  177500       NaN     NaN           NaN
8  199800         툴젠   -2514.333333  115400       NaN     NaN           NaN
9  204210     모두투어리츠    3093.333333    3475  204210.0  모두투어리츠     85.166667

        bps        per       pbr
0       NaN        NaN       NaN
1   54068.0  15.695091  1.829178
2       NaN        NaN       NaN
3  295780.0  13.931338  0.860437
4       NaN        NaN       NaN
5  108090.0  14.283226  0.758627
6   40684.0  25.185866  2.470259
7       NaN        NaN       NaN
8       NaN        NaN       NaN
9    5335.0  40.802348  0.651359

In [86]:
## df1에 가격이 50000 <- df2

mask = df1['price'] < 50000
print(mask)

df1_50000 = df1[mask]
print(df1_50000.head())

df1_df2 = pd.merge(df1_50000, df2, on = 'id', how = 'left')
print(df1_df2)

0    False
1    False
2     True
3    False
4     True
5    False
6    False
7    False
8    False
9     True
Name: price, dtype: bool
       id stock_name         value  price
2  138250      엔에스쇼핑  14558.666667  13200
4  142280     녹십자엠에스    468.833333  10200
9  204210     모두투어리츠   3093.333333   3475
       id stock_name         value  price    name        eps     bps
0  138250      엔에스쇼핑  14558.666667  13200     NaN        NaN     NaN  \
1  142280     녹십자엠에스    468.833333  10200     NaN        NaN     NaN
2  204210     모두투어리츠   3093.333333   3475  모두투어리츠  85.166667  5335.0

         per       pbr
0        NaN       NaN
1        NaN       NaN
2  40.802348  0.651359

In [94]:
## group_by()

titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'sex', 'class', 'fare', 'survived']]

# df.head()
# df.fare.mean()
df_male_idx = df.sex == 'male'
df_male = df[df_male_idx]

# df_male.fare.mean()

25.523893414211443

In [95]:
df_group = df.groupby(['class'])
df_group['fare'].mean()

class
First     84.154687
Second    20.662183
Third     13.675550
Name: fare, dtype: float64

In [96]:
for key, group in df_group:
   print('key', key)
   print()
   print(group.head()) 
   print()

key ('First',)

     age     sex  class     fare  survived
1   38.0  female  First  71.2833         1
3   35.0  female  First  53.1000         1
6   54.0    male  First  51.8625         0
11  58.0  female  First  26.5500         1
23  28.0    male  First  35.5000         1

key ('Second',)

     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
17   NaN    male  Second  13.0000         1
20  35.0    male  Second  26.0000         0
21  34.0    male  Second  13.0000         1

key ('Third',)

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
2  26.0  female  Third   7.9250         1
4  35.0    male  Third   8.0500         0
5   NaN    male  Third   8.4583         0
7   2.0    male  Third  21.0750         0

In [98]:

group1 = df_group.get_group('First')
print(group1.head())
print('\n\n')
group2 = df_group.get_group('Second')
print(group2.head())

     age     sex  class     fare  survived
1   38.0  female  First  71.2833         1
3   35.0  female  First  53.1000         1
6   54.0    male  First  51.8625         0
11  58.0  female  First  26.5500         1
23  28.0    male  First  35.5000         1



     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
17   NaN    male  Second  13.0000         1
20  35.0    male  Second  26.0000         0
21  34.0    male  Second  13.0000         1

In [100]:
df.head()

df_group_two = df.groupby(['class', 'sex'])
df_group_two.age.mean()

class   sex
First   female    34.611765
        male      41.281386
Second  female    28.722973
        male      30.740707
Third   female    21.750000
        male      26.507589
Name: age, dtype: float64

In [101]:
for key, group in df_group_two:
    print('key = ', key)
    print()
    print(group.head())

key =  ('First', 'female')

     age     sex  class      fare  survived
1   38.0  female  First   71.2833         1
3   35.0  female  First   53.1000         1
11  58.0  female  First   26.5500         1
31   NaN  female  First  146.5208         1
52  49.0  female  First   76.7292         1
key =  ('First', 'male')

     age   sex  class      fare  survived
6   54.0  male  First   51.8625         0
23  28.0  male  First   35.5000         1
27  19.0  male  First  263.0000         0
30  40.0  male  First   27.7208         0
34  28.0  male  First   82.1708         0
key =  ('Second', 'female')

     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
41  27.0  female  Second  21.0000         0
43   3.0  female  Second  41.5792         1
53  29.0  female  Second  26.0000         1
key =  ('Second', 'male')

     age   sex   class  fare  survived
17   NaN  male  Second  13.0         1
20  35.0  male  Second  26.0         0
21  34.0  male  Second  13.0         1
33  66.0  male  Second  10.5         0
70  32.0  male  Second  10.5         0
key =  ('Third', 'female')

     age     sex  class     fare  survived
2   26.0  female  Third   7.9250         1
8   27.0  female  Third  11.1333         1
10   4.0  female  Third  16.7000         1
14  14.0  female  Third   7.8542         0
18  31.0  female  Third  18.0000         0
key =  ('Third', 'male')

     age   sex  class     fare  survived
0   22.0  male  Third   7.2500         0
4   35.0  male  Third   8.0500         0
5    NaN  male  Third   8.4583         0
7    2.0  male  Third  21.0750         0
12  20.0  male  Third   8.0500         0

In [105]:
df_group_two.std()
# my_group = df_group_two.get_group(('Second', 'male'))
# my_group.head()

                     age       fare  survived
class  sex
First  female  13.612052  74.259988  0.176716
       male    15.139570  77.548021  0.484484
Second female  12.872702  10.891796  0.271448
       male    14.793894  14.922235  0.365882
Third  female  12.729964  11.690314  0.501745
       male    12.159514  11.681696  0.342694

In [107]:
df_group_two.mean()
df_group_two.median()

                age      fare  survived
class  sex
First  female  35.0  82.66455       1.0
       male    40.0  41.26250       0.0
Second female  28.0  22.00000       1.0
       male    30.0  13.00000       0.0
Third  female  21.5  12.47500       0.5
       male    25.0   7.92500       0.0

In [110]:
## group_by()

titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'class', 'fare', 'survived']]

# df.head()
# df.fare.mean()
class_group = df.groupby(['class'])

print(class_group.mean())
print(class_group.median())

              age       fare  survived
class
First   38.233441  84.154687  0.629630
Second  29.877630  20.662183  0.472826
Third   25.140620  13.675550  0.242363
         age     fare  survived
class
First   37.0  60.2875       1.0
Second  29.0  14.2500       0.0
Third   24.0   8.0500       0.0

In [112]:
class_group.agg(['mean', 'median', 'std'])

              age                         fare                      survived
             mean median        std       mean   median        std      mean
class
First   38.233441   37.0  14.802856  84.154687  60.2875  78.380373  0.629630  \
Second  29.877630   29.0  14.001077  20.662183  14.2500  13.417399  0.472826
Third   25.140620   24.0  12.495398  13.675550   8.0500  11.778142  0.242363


       median       std
class
First     1.0  0.484026
Second    0.0  0.500623
Third     0.0  0.428949

In [116]:
## groupby filter

# df.head()
# df_le_30 = df[df.age < 30]

# class_group = df.groupby(['class'])


age_filter = class_group.filter(lambda x: x['age'].mean() < 30)
print(age_filter)
age_filter['class'].value_counts()

      age   class     fare  survived
0    22.0   Third   7.2500         0
2    26.0   Third   7.9250         1
4    35.0   Third   8.0500         0
5     NaN   Third   8.4583         0
7     2.0   Third  21.0750         0
..    ...     ...      ...       ...
884  25.0   Third   7.0500         0
885  39.0   Third  29.1250         0
886  27.0  Second  13.0000         0
888   NaN   Third  23.4500         0
890  32.0   Third   7.7500         0

[675 rows x 4 columns]

class
Third     491
Second    184
First       0
Name: count, dtype: int64

In [118]:
## pivot table

class_group.agg(['mean', 'median'])
print(df.head())

    age  class     fare  survived
0  22.0  Third   7.2500         0
1  38.0  First  71.2833         1
2  26.0  Third   7.9250         1
3  35.0  First  53.1000         1
4  35.0  Third   8.0500         0

In [119]:
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'sex', 'class', 'fare', 'survived']]

In [122]:
pdf = pd.pivot_table(
    df,
    index = 'class',
    columns = 'sex',
    values = ['survived'],
    aggfunc=['mean']
)
pdf

            mean
        survived
sex       female      male
class
First   0.968085  0.368852
Second  0.921053  0.157407
Third   0.500000  0.135447

In [123]:
df = sns.load_dataset('titanic')

df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [127]:
df.age.mean()

df['deck'].value_counts(dropna=False) # 범주형

deck
NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: count, dtype: int64

In [135]:
## nan 

# print(df.head().isnull())

print(df.isnull().sum())
print(df.shape)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64
(891, 15)

In [137]:
##
df_thres_na = df.dropna(axis = 1, thresh= 500)
print(df_thres_na.head())
print(df_thres_na.shape)

##
df_age = df.dropna(subset=['age'], how = 'any', axis = 0)
df_age.shape

   survived  pclass     sex   age  sibsp  parch     fare embarked  class
0         0       3    male  22.0      1      0   7.2500        S  Third  \
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male  embark_town alive  alone
0    man        True  Southampton    no  False
1  woman       False    Cherbourg   yes  False
2  woman       False  Southampton   yes   True
3  woman       False  Southampton   yes  False
4    man        True  Southampton    no   True
(891, 14)

(714, 15)

In [138]:
##
rep_value = df.age.mean()
df.age.fillna(rep_value, inplace=True)

df.age.isnull().sum()

0

In [150]:
df.deck.fillna(method = 'ffill', inplace = True)
df.deck

0      NaN
1        C
2        C
3        C
4        C
      ...
886      C
887      B
888      B
889      C
890      C
Name: deck, Length: 891, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [154]:
df = pd.DataFrame({'c1':['a', 'a', 'b', 'a', 'b'],
                  'c2':[1, 1, 1, 2, 2],
                  'c3':[1, 1, 2, 2, 2]})

print(df)

df_dup = df.duplicated()
print(df_dup)

print(df['c1'].duplicated())

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2
0    False
1     True
2    False
3    False
4    False
dtype: bool
0    False
1     True
2    False
3     True
4     True
Name: c1, dtype: bool

In [155]:
df2 = df.drop_duplicates()

df2

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2